<a href="https://colab.research.google.com/github/priyanshgupta1998/All_codes/blob/master/pandas0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
df = pd.read_csv('/home/practice1_salary0.csv')
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [3]:
len(df)

16

In [4]:
df.shape

(16, 4)

In [0]:
inputs = df.drop('salary_more_then_100k',axis = 'columns')  # remove the last column from the dataset
target = df['salary_more_then_100k']

In [9]:
inputs.head()

  company                  job     degree
0  google      sales executive  bachelors
1  google      sales executive    masters
2  google     business manager  bachelors
3  google     business manager    masters
4  google  computer programmer  bachelors

In [29]:
print(target.head())

0    0
1    0
2    1
3    1
4    0
Name: salary_more_then_100k, dtype: int64

In [32]:
len(target)

16



```
Now we know that machine learning algorithms can only work on numbers.
they can not understand 'labels/text/character'.
```

SO we have to  convert above three columns in inputs into the 'numerical value'
For this we will use **label encoders**

In [0]:
from sklearn.preprocessing import LabelEncoder

Now i will create three diffeent objects of 3 colunmns

In [0]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

Now i will create three aditional columns in the dataset with numerical valuse corresponding to  there label columns in the datasaet.

In [0]:
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_job.fit_transform(inputs['job'])
inputs['degree_n'] = le_degree.fit_transform(inputs['degree'])

In [21]:
inputs.head()

  company                  job     degree  company_n  job_n  degree_n
0  google      sales executive  bachelors          2      2         0
1  google      sales executive    masters          2      2         1
2  google     business manager  bachelors          2      0         0
3  google     business manager    masters          2      0         1
4  google  computer programmer  bachelors          2      1         0

Now i will create another dataset which contains only numerical values corresponding to there label

In [0]:
input_n = inputs.drop(['company','job','degree'],axis=1)

In the above code segment we canuse' axis = 1 / columns' to remove a column  from the dataset and axis=' 0 / rows  ' to remove a row .

In [31]:
input_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

Now i will train the  model by using classifier

In [0]:
from sklearn import tree

In [0]:
model = tree.DecisionTreeClassifier() #create one constructer object

In [37]:
model.fit(input_n,target)    #train the model with training dataset

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

Now chech the accuracy of trained model by  predicting any testdata using score( ) funcition

In [38]:
model.score(input_n ,target )   #how much our model is trained .

1.0

In the above code segment i used same dataset to calculate the prediction_accuracy (which i used to trained the model ) ,that's why it gives the 100% score.

In [39]:
print(model.predict([[2,0,1]]))   # predict the output of id =3 in input_n dataset

[1]

In [40]:
print(model.predict(input_n))   # predict all the output of the inuput_n dataset.

[0 0 1 1 0 1 0 0 0 1 1 1 1 1 1 1]

In [0]:
target_pre = model.predict(input_n)

In [42]:
model.score(input_n ,target_pre )

1.0